# GetElementIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSection..::..GetElementIds Method
MEPSection Class See Also
---
Gets all element ids that are contained in the section.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<ElementId> GetElementIds()
```

Visual Basic
---
```text
Public Function GetElementIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetElementIds()
```

# See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace